[
  {
    "asin": "B00B1O15C6",
    "title": "Nokia Lumia 820 8GB GSM 4G LTE Windows 8 Smartphone - Black - AT&T - No Warranty",
    "description": [
      "The Nokia Lumia 820 with 4G LTE and Windows Phone 8 is truly a value-priced powerhouse. Enjoy the fastest web browsing possible thanks to the 1.5GHz Dual-Core Snapdragon Qualcomm Processor, Internet Explorer 10, and much more. And full Windows Phone 8 interoperability allows unprecedented storage and backup."
    ],
    "price": "$149.99",
    "brand": "Nokia",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51fWwH31nYL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B005TMMAHU",
    "title": "Blackberry Torch 9860 Unlocked Phone with 4GB Internal Memory, Blackberry OS 7, 3G and 5MP Camera - International Version (Black)",
    "description": [
      "The BlackBerry Torch 9860 weighs 4.7 ounces and measures 4.72 x 2.44 x 0.45 inches. Its 1230 mAh lithium-ion battery is rated at up to 6.8 hours of talk time, and up to 333 hours (13.9 days) of standby time. It runs on the 2G Network on 850/900/1800/1900 MHz GSM/GPRS/EDGE"
    ],
    "price": "$27.57",
    "brand": "BlackBerry",
    "imageURLHighRes": [],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B008P5A5SO",
    "title": "Motorola Atrix 2 4G MB865 - Unlocked GSM Quad Band - Android Gingerbread 2.3.5 - 8MP - 3D HD",
    "description": [
      "Atrix 2, Battery, Battery Door, USB Cable, AC Adapter and Manual ANDROIDTM PLATFORM Android 2.3.5 (Gingerbread) MULTIPLE NETWORKS WCDMA 850/1900/2100, GSM 850/900/1800/1900, HSDPA 21.1 Mbps (Category 14) Edge Class 12, GPRS Class 12, eCompass, AGPS WIRED STEREO DEVICE EFFECTS 3D Stereo, Home Theater, Live Stage, Custom DLNA (DIGITAL LIVING NETWORK ALLIANCE) Stream, store and share content with compatible devices around the home like HDTVs, game consoles and PCs"
    ],
    "price": "$87.34",
    "brand": "Motorola",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51CAE3q9fCL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B00B04UG6I",
    "title": "New Factory Unlocked LG Optimus L9 P768 White International GSM Android Phone HSDPA 900 / 2100 on 3G No warranty",
    "description": [
      "Package Contents: 1 Phone 1 Handsfree 1 Battery and Charger (with USA need Adapter if needed) 1 User Guide (may not be English Menu, but we can help to provide the link if you need to download for the original Manufacture provider)"
    ],
    "price": "$65.11",
    "brand": "LG",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/519fvwUoqOL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B0085EIE38",
    "title": "Blackberry Curve 9320 Unlocked GSM OS 7.1 Smartphone - 2g Only, Not Compatible with AT&T/Verizon Black",
    "description": [
      "No matter what you're into, BlackBerry Curve 9320 Smartphone have what you need to keep up, including a powerful processor and super fast browser. And with a 3.2 MP camera with flash, you'll be ready to capture all those fun and memorable moments. The easy-to-use next generation BlackBerry 7 OS delivers the smoothest and fastest BlackBerry experience to date. Get connected in an instant with the dedicated BBM shortcut key on BlackBerry Curve 9320 Smartphone. One touch launches the BBM app so you can chat in real time or share pictures, videos and files. Plan a night out with a group message, or chat privately one-to-one. BBM is built into your favorite apps like Facebook and Twitter, so you can share your Facebook status update or latest Tweet without ever leaving the app. Stay in touch when it counts. With the longest lasting battery yet in a 2G/3G BlackBerry Curve Smartphone, you can get things done and connect with the people who matter most. The next generation BlackBerry operating system (OS) is packed with powerful new features and innovative pre-installed apps. It delivers the smoothest and fastest BlackBerry experience to date. Plus, enjoy voice-activated universal search with Bing Auto Suggest in the BlackBerry Browser to find what you're looking for hands-free. Connect to friends and family, and get things done on the go with Wi-Fi connectivity.2 Now you can use Wi-Fi instead of your plan's minutes for calling on your BlackBerry Curve 9320. Unlocked, compatible with T-mobile, not compatible with AT&T / Sprint / Verizon"
    ],
    "price": "$26.76",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31bkX%2BLoHpL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B00642EWMU",
    "title": "Samsung Galaxy S II i777 16GB GSM Android Smartphone Unlocked",
    "description": [
      "The Samsung Galaxy S II is the follow-up to Samsung's popular Galaxy S Captivate. This sequel upgrades to a faster 1.2 GHz dual-core processor, a larger 4.3-inch Super AMOLED Plus display, a 8 megapixel camera, and better HD video capture and output. This high-end Android smartphone also features DLNA streaming, 16GB of built-in memory, fast HSPA data, multi-format music player, WiFi, HTML browser, video streaming, touchscreen, and GPS navigation. This quadband GSM smartphone is also equipped with WCDMA modes for international use, and offers access to thousands of apps, games, movies, and music available on Google's Play Store."
    ],
    "price": "$89.80",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41uTZI3yyML.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B0099LATZ2",
    "title": "Samsung Galaxy Note II N7100 16GB Gray-Unlocked International Phone",
    "description": [
      "Enjoy a tablet-like web browsing experience with the Samsung Galaxy Note 2. The generous 5.55 high-definition capacitive display reduces scrolling or transitioning between pages. You can also draw or write directly onto the screen with your finger, or the S Pen, which is included."
    ],
    "price": "$129.00",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/413c00l4cTL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B006AUZYMS",
    "title": "Samsung Galaxy S II Skyrocket I727 16GB Unlocked GSM 4G LTE Smartphone - Black",
    "description": [
      "The Samsung Galaxy S II is the follow-up to Samsung's popular Galaxy S Captivate. This sequel upgrades to a faster 1.2 GHz dual-core processor, a larger 4.3-inch Super AMOLED Plus display, a 8 megapixel camera, and better HD video capture and output. This high-end Android smartphone also features DLNA streaming, 16GB of built-in memory, fast HSPA data, multi-format music player, WiFi, HTML browser, video streaming, touchscreen, and GPS navigation. This quadband GSM smartphone is also equipped with WCDMA modes for international use, and offers access to thousands of apps, games, movies, and music available on Google's Play Store."
    ],
    "price": "$78.92",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51ECZURzLUL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B00AKG2XSQ",
    "title": "LG Optimus L9 P769, 4G (T-Mobile)",
    "description": [
      "The latest and greatest of the Optimus line, is the LG Optimus L9. This phone has a sophisticated, slim design that will fit any from your purse to your pocket. Running on Android 4.1.2 (Jelly Bean) with a powerful 1.0 Ghz Dual-Core processor your experience when surfing the internet, updating your facebook status, and playing your app will be silky smooth. With Quickmemo, you can capture your screen and make notes with your finger then share them online, by text and email. With Smartshare you can simply send your videos to your smartshare enabled tv. With a sweet 5.0 megapixel camera and LED flash lets you capture continuous pictures in a row and with panorama shot, you can capture a beautiful picture of the skyline. Worried about a shaky picture, just say cheese and your picture will be snapped! So why are you still reading this? Go ahead and add this beautiful LG Optimus L9 in Excellent condition to your cart now!Phone SpecificationsCameraConnectivityDataDisplayGeneralInputMessaging 5.0 MPBluetoothA-GpsTouch ScreenRinger IDPredictive TextEmail Camera FlashMobile HotspotHSPA Ringer ProfilesVoice-activated dialingSide KeysMMS Picture Messaging"
    ],
    "price": "$55.45",
    "brand": "LG",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/3189etJiOSL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B004T36GCU",
    "title": "HTC Inspire 4G Unlocked Phone A9192, Black",
    "description": [
      "The HTC Inspire 4G features a massive 4.3 inch Super LCD display, a 1 GHz second generation Qualcomm QSD8255 Snapdragon processor, 8MP camera with auto-focus and LED flash, 768MB/RAM 4GB/ROM, Android 2.2 with HTC Sense 2.0 (which includes integration with htcsense com), and support for AT&T's 4G HSPA+ network. The HTC Desire HD with a huge cinematic 4.3-inch display, 1GHz CPU Processing Speed, Dolby Mobile and SRS virtual surround sound. Websites, videos, music, games and apps really rock on your HTC Desire HD. The HTC Desire HD delivers maps with zero wait, zero dead spots and zero data roaming fees. Have trouble knowing which way to turn when using a map? Relax. Maps on the HTC Desire HD always point you in the right direction. Need an ATM, a gas station or a quick bite to eat? With HTC Desire HD all the top spots appear right on your home screen. You're likely to become very attached to your HTC Desire HD. That's why we had the idea to bring the HTC Sense experience online. Can't find your phone? Use HTCSense.com to show you that it's under your sleeping cat. Worried you'll miss something because you left it at home today? Use HTCSense.com to send and receive texts and to forward your calls to another number. Frantic about personal data on your phone that's been lost or stolen? Log into HTCSense.com to quickly lock and wipe it remotely. The HTC Desire HD has a vivid, cinematic screen combined with Dolby Mobile and SRS audio, which makes it great for watching homemade YouTube? epics - filmed with your phone's on-board HD camera. And of course you can watch the latest Hollywood blockbuster that you've loaded on your SD card. Use the built-in Locations widget to find places to eat, things to see and how to get around the area. Leave the guidebooks at home - your HTC Desire HD is your ideal traveling companion.Band info: 2G Network - GSM 850 / 900 / 1800 / 1900 3G Network - HSDPA 850 / 1900"
    ],
    "price": "$98.21",
    "brand": "HTC",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41nkXPoyK3L.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B003X26V50",
    "title": "Blackberry Tour 9630 Unlocked GSM CDMA Cell Phone (Black)",
    "description": [
      "3G HSDPA 850 / 1900 / 2100; 2G GSM 850 / 900 / 1800 / 1900.QWERTY keypad, Trackball navigation, BlackBerry maps, Document editor (Word, Excel, PowerPoint, PDF), Media player (MP4/H.263/H.264/WMV/MP3/WAV/eAAC+/WMA), Organizer. Camera: 3.15 MP, 2048x1536 pixels, autofocus, LED flash. Video. Internal Memory: 256 MB. MicroSD expandable (8 GB max). Bluetooth 2.0 with A2DP, EDGE, GPS capable. Stand-by: Up to 336 hours, Talk time: Up to 5 hours."
    ],
    "price": "$65.99",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/513uu3l5B-L.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B004DPZ2T2",
    "title": "BlackBerry 9780 Bold locked Smartphone with 5 MP Camera, Bluetooth, 3G, Wi-Fi, and MicroSd Slot --T-Mobile Version with no Warranty (white)",
    "description": [
      "3G (HSDPA) Compatible, 624 MHz processor, BlackBerry OS 5.0, Supports up to 32GB microSD card, Full QWERTY keyboard, Touch-sensitive optical trackpad, 2.44\" LCD display, GPS, Wi-Fi, Bluetooth, 3.5mm"
    ],
    "price": "$99.00",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41%2BG8O5FeIL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B008MC3N34",
    "title": "Samsung Galaxy S3 SGH-i747 4G LTE GSM Unlocked 16GB No Warranty (White)",
    "description": [
      "The Samsung Galaxy S III is a high-end Android smartphone featuring 1.5GHz dual-core S4 processor, a gorgeous Super AMOLED 4.8-inch display, and an 8-megapixel camera capable of recording HD video and stills at the same time. The S3 is also equipped with NFC technology, 16GB built-in memory, microSD slot for additional storage, WiFi, GPS, and quadband GSM along with WCDMA modes for international use. This device also offers access to thousands of apps, games, movies, books, and music on the Google Play Store."
    ],
    "price": "$27.57",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/414T%2BzlyJBL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B004XIE6WI",
    "title": "Samsung S5830 Galaxy Ace - Unlocked Phone - Black",
    "description": [
      "The Samsung GALAXY Ace takes a minimal approach in its design, resulting in a sophisticated mobile that will allure. The smooth rounded edges and slim, compact size are a pleasure to wrap your fingers around, just as the large 3.5\" HVGA screen is a delight to watch. with approximately 100, 000 apps available on the Android Market, there's no end to what your mobile can do. Enjoy countless games, utilities, news, health and finance applications with more being added each day. The scope of what GALAXY Ace can do is virtually unlimited! GALAXY Ace offers a fully integrated one-page layout of your phone book, IM, email, and SNS. You can also organize and view your contacts according to four separate formats-Info, History, Activity and Media-so you can customize your layout just the way you want it. GALAXY Ace comes fully loaded with all I need for smooth web browsing, downloading and more. Equipped with a strong 800MHz processor and Wi-Fi, I can surf the web, download apps quickly, and share content with friends. Multitasking is a breeze, so we can have fun in all sorts of ways. GALAXY Ace features Quicktype by SWYPE, an intelligent interface that connects the dots made by your finger to figure out what you are trying to write. By moving your finger across the keypad from letter to letter in one fluid motion, the mobile senses exactly what you want to say!"
    ],
    "price": "$71.53",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51rxUtK--LL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B0078LXM40",
    "title": "HTC 1 X Unlocked GSM Android Smartphone with Beats Audio Sound and Front-Facing Speakers - White",
    "description": [
      "The HTC One X, also known as HTC Endeavor, is HTC's technology leading superphone. With the help of the powerful 1.5 GHz processor, a magnificent 4.7-inch screen, Beats AudioTM, and an 8 MP camera with advanced camera technology called the HTC ImageSenseTM, the One X goes beyond your everyday Smartphone. The HTC ImageSenseTM technology allows you to take photos in any conditions, including low light, as well as take full advantage of the camera's continuous shooting mode that enables you to take multiple shots at once. Furthermore, with HTC Sense 4.0 and Android 4.0 Ice Cream Sandwich on board, the One X also perfectly balances work and play. The quad core processor ensures incredibly fast web browsing and a high quality gaming experience, while the camera with an object distant sensor ensures impressive image quality. With the HTC One X you will also be able to take advantage of NFC3 connectivity, which is Google Wallet compatible, up to 25GB of free cloud storage via Dropbox (an online storage application), and the option to connect your One X to your TV via the HTC Media Link HD. Beats AudioTM will provide you with an enhanced audio experience, whether you are listening to music on YouTube, a downloaded soundtrack or simply watching a movie. Ultimately, HTC One X combines the very best innovative technologies with a great entertainment experience, all encompassed in a stylish and elegant design."
    ],
    "price": "$177.33",
    "brand": "HTC",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41soExbQbHL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B009ZC90P0",
    "title": "Nokia Lumia 920 32GB Unlocked GSM Windows 8 Smartphone w/Carl-Zeiss Optics Camera - White",
    "description": [
      "4G LTE Nokia Lumia 920 with Windows Phone 8 was built for amazing clarity, power and speed that lets you capture, share and relive moments as if you were still there. Youll enjoy a rich user-experience in almost any conditions with the stunning 4.5-inch PureMotion HD and ClearBlack display that blocks incoming light reflections through a polarized layer to improve screen visibility under direct sunlight. The 332 ppi sculpted 2.5 D Corning Gorilla Glass 2.0, with color-boosting technology, Sunlight Readability Enhancement, High Brightness Mode, and a power-efficient LCD paired with 4G/LTE and Internet Explorer 10 make for faster, clearer web browsing. When you discover all that the Nokia Lumia 920 has to offer including premium design and powerful dual-core 1.5 GHz Qualcomm Snapdragon Processor- nothing less will do."
    ],
    "price": "$91.88",
    "brand": "Nokia",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/219RnsoXNVL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B00598BY6W",
    "title": "Apple iPhone 4 16GB (A1332) - GSM Factory Unlocked - No Warranty (Black)",
    "description": [
      "This phone can be restored within iTunes and is compatible with all versions of iOS7. This product does not have a manufacturer warranty rather a 30-day return period with seller. At just 9.3mm, the iPhone 4 is thin as a rake but the front and back are 30 times stronger than the usual plastic. Reason - aluminosilicate glass, the stuff that windshields of military choppers are made of. The periphery is customized alloy, 5 times stronger than steel. Your accidental dropping wont hurt your pocket-communicator. The Retina Display packs in 4 times the amount of pixels (326 per inch) of iPhone 3, and makes the text and images slicing sharp. Thanks to the added 960 x 640 pixel screen watching of HD movies on the iPhone 4 becomes a gasp. When you become a shutterbug behind the iPhone 4 camera, you shoot 5 megapixel images and high-definition videos at 720p resolution, with the LED flash and autofocus that make things easier. Opt for the iMovie video editing software, and you become a movie maker. If you happen to have Wi-Fi around, the FaceTime feature gets you into true worldwide video chat and staying in touch becomes real personal. And all it takes to choose between the front and rear camera is a tap. The 3-axis gyro, when coupled with accelerometer, results in 6-axis motion sensing, and thats as good as it can ever get for gaming on a cell phone. With 7 hours of talk time (3G)/10 hours of video/40 hours of audio, the iPhone 4 packs in enough power to let you do fast multitasking."
    ],
    "price": "$83.67",
    "brand": "Apple",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31WV7prQNQL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B008VUZPUQ",
    "title": "Apple iPhone 3GS A1303 16GB GSM Unlocked SmartPhone - Black",
    "description": [
      "This update to the iPhone 3G upgrades to a faster processor (600 MHz), a 3 megapixel auto-focus camera, voice control, video recording capabilities, and 16GB of internal memory. Other features of this phone include GPS, large multi-touch display, WiFi, full web-browser, music player, email client, Bluetooth, and 3.5mm headphone jack. This is a great feature laden phone compatible with the over 100,000 applications available in the Apple App Store.",
      "This device may require a data plan for activation. Please, contact your phone carrier for details."
    ],
    "price": "$52.49",
    "brand": "Apple",
    "imageURLHighRes": [],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B005FLI78G",
    "title": "Samsung Galaxy Young S5360 Unlocked Gsm Quadband Cell Phone, Black",
    "description": [
      "Start your new smart life with Galaxy Y S5360 for dynamic mobile users on the go who want to stay in touch and connected. All the bells and whistles of an Android driven Smartphone with exciting apps, faster downloads, Wi Fi connectivity on a more intuitive, enticing UI. Accessing web based apps and mobile Internet has never been easier for a new generation always on the move. Stylish smarts are full featured on this model including big 3 display and larger QWERTY keyboard but still compact. Welcome to a smarter, better life."
    ],
    "price": "$99.76",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41ZJfbMk6sL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B002KQLUVU",
    "title": " BlackBerry 8520 Unlocked Phone with 2 MP Camera, Bluetooth, Wi-Fi--International Version with No Warranty (Black)",
    "description": [
      "The BlackBerry Curve 8520 smartphone fits neatly in your hand, and comes with a full QWERTY keyboard that makes typing and sending messages easy, and comfortable. The bright screen displays over 65,000 colors, providing a great viewing experience. Access what's important with trackpad navigation. Like a laptop, the trackpad lets you scroll through menus, icons, and information by gliding your finger over it. Press and click to select an item and navigate to where you want to go. Control music and multimedia with dedicated media keys found atop the new BlackBerry Curve 8520 smartphone. Skip over songs, pause music to talk, or repeat your favorites over and over. You can even mute phone calls with the easy-access mute button."
    ],
    "price": "$16.00",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/411rNJgCOLL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B0081HBX2I",
    "title": "Samsung Galaxy Note I717 16GB 4G LTE GSM Android Phone - Carbon Blue (AT&T version)",
    "description": [
      "The Samsung Galaxy Note SGH-I717 is a unique device bridging the gap between phones and tablets with its extra-large 5.3-inch Super AMOLED HD display. The Galaxy Note offers a unique feature that includes a stylus pen and handwriting recognition, with multiple exclusive apps for taking notes, sketching, and more. This device is also equipped with 4G LTE data, 8-megapixel camera with a 2-megapixel front camera, 1.5 GHz dual-core processor, Wi-Fi, DLNA WiFi streaming, and quadband GSM along with WCDMA modes for international use. You can also use this device to access thousands of apps, games, movies, books, and music on Google's Play Store."
    ],
    "price": "$61.03",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31Pl90x9mWL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B00B3HX5Y2",
    "title": "Samsung Galaxy S3 Mini GT-i8190 GSM Unlocked Android Smartphone White",
    "description": [
      "GSM 850/900/1800/1900; HSDPA 900/1900/2100 Super AMOLED capacitive touchscreen 4.0-Inch 5 MP Primary Camera, autofocus, LED flash, Video 720p@30fps, Secondary VGA camera OS Android OS, v4.1 (Jelly Bean), CPU Dual-core 1 GHz, Wi-Fi 802.11 a/b/g/n, DLNA, Wi-Fi Direct, Wi-Fi hotspot, Bluetooth v4.0 with A2DP, LE, EDR 8GB Internal memory; 1 GB RAM; microSD Memory card slot; Standard battery, Li-Ion 1500 mAh"
    ],
    "price": "$74.29",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41KClES0lmL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B00A2V7LHC",
    "title": "Nokia Lumia 920, Red 32GB (AT&T)",
    "description": [
      "The Lumia 920 is a Windows Phone 8 device with a unibody design, 4.5 PureMotion HD+ ClearBlack display, dual-core 1.5GHz Snapdragon processor, NFC, wireless charging, and 32GB storage. It features an 8MP PureView Carl Zeiss camera with optical image stabilization, 1080p video, and a 1.2MP front camera. Connectivity includes 4G LTE, WiFi, Bluetooth, and AT&T Mobile Hotspot support. Integrated apps include Facebook, Twitter, navigation, and SkyDrive cloud storage."
    ],
    "price": "$58.76",
    "brand": "Nokia",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41qRH6%2B1yXL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51Wz2vtUgrL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51WStlCsgNL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31PRLLPM6cL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/21JrvOvbWIL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/21CqPO8Wc5L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51FtPy6ZWsL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41m4waCbrlL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Carrier Cell Phones"]
    ]
  },
  {
    "asin": "B00AEK5V5K",
    "title": "Samsung Galaxy S III Mini I8190 Unlocked, Ceramic White",
    "description": [
      "With its gentle curves and comfortable grip, the Samsung Galaxy S III Mini continues the sophisticated design aesthetic seen in the Galaxy S III. Elegant natural design meets vivid viewing, thanks to a dazzling 4.0-inch Super AMOLED display that brings out the best in all your entertainment. With the Android 4.1 Jelly Bean operating system, you can enjoy a range of great apps and games as well as new functionality. And, with smart and intelligent services like Pop-up Play, Best Photo, Smart Stay and Social Tag, the Galaxy S III Mini helps make life easier and richer. Galaxy S III mini resembles Galaxy S III's minimal and organic design inspired by nature. Its human-centric nature provides an ergonomic and comfortable experience with enhanced usability. This is what we call seeing reality. Its beautiful 4.0-inch Super AMOLED display offers a generous viewing experience that lets you view multimedia and Web content in brilliant color and clarity. Powered by Android 4.1 (Jelly Bean), the latest version of the worlds most popular smartphone operating system. Jelly Bean has fast, fluid and smooth graphics along with a new Google Search experience featuring Google Now, which brings you just the right information, before you even ask. Pop up play allows you to send text messages while watching a video. It is compact but it still lets you do things simultaneously. Please do not miss any of the action. Samsung's advanced natural language recognition software, lets you use your voice to unlock the phone with simple customized commands, or to play your favorite songs, turn the volume up or down, organize your schedule, or automatically launch the camera and start taking photos. When you pick up your phone, wouldnt it be nice if it let you know what has been happening since youve been gone? Samsung GALAXY SIII mini knows you came back and gives you a brief vibrating nudge to inform you about missed calls and new messages. How thoughtful is that?"
    ],
    "price": "$89.99",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41pbRZ977DL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31qptjvzx7L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/413ZiqSXy0L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51Wm-3V9fhL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B00BBFOO28",
    "title": "Blackberry Z10 16GB OS 10 GSM Unlocked Smartphone - Black",
    "description": [
      "Product Description 4.2-inch touchscreen display with 1280 x 720 resolution BlackBerry 10 OS 8MP rear facing, 2MP front facing 1.5 Ghz Dual Core Processor Up to 32GB of expandable memory with a micro SD card"
    ],
    "price": "$27.57",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41w7Bis1NJL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/410QUNsnnOL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B009CEZGKE",
    "title": "AT&T Fusion 2 ANDROID go Phone",
    "description": [
      "For efficient interaction over the phone, go for the AT&T Huawei Fusion 2 Cell Phone. For fun applications, easy access, and smooth user interface, this cell phone uses Android 2.3 Operating system. Featuring an 800MHz Qualcomm Processor and 512MB RAM, it manages all the tasks at high speed. It has 4 GB of internal memory to store your files and you can insert a 32 GB microSD card to expand its storage capacity. The 3.5in. Touchscreen Display lets you view your images clearly. You can shoot pictures instantaneously with its 3.2 MP camera. Plus, it has a significant wireless features that allows you to access the web, transfer files or locate devices using its Bluetooth and Wi-Fi functions. Get the AT&T Huawei Fiji Cell Phone today"
    ],
    "price": "$53.28",
    "brand": "AT&T",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41q4J%2B-kTcL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41Iw4cvPzUL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31eyDr0jSOL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31gWakLh14L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51MjW0qJGfL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Carrier Cell Phones"]
    ]
  },
  {
    "asin": "B005ZD6WQS",
    "title": "Apple iPhone 4 8GB Unlocked- Black",
    "description": [
      "Size:8 GB | Color:Black The iPhone 4 is a follow-up to the popular 3GS model and steps up to a very high-resolution display, 5 megapixel camera with LED flash, and HD video capture. This model also features a front facing camera, a 3.5-inch multi-touch display, full web browser, WiFi, Bluetooth compatibility, GPS, and 8 GB of internal memory. The iPhone 4 is a feature-packed smartphone with quad-band GSM and WCDMA modes supporting international use.This device may require a data plan for activation. Please, contact your phone carrier for details."
    ],
    "price": "$95.15",
    "brand": "Apple",
    "imageURLHighRes": [],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B001OD2OAQ",
    "title": "BlackBerry Curve 8900 Javelin Unlocked Phone with 3.2 MP Camera, GPS Navigation, Stereo Bluetooth, and MicroSD Slot - no Warranty (Black)",
    "description": [
      "A sleek new twist on a classic style. You can keep your finger on the pulse of whats important to you with the BlackBerry Curve 8900 smartphone. The striking 480x360-pixel screen offers up crisp on - the-go video, images, text, maps and more. With a refined design, the BlackBerry Curve 8900 smartphone is an easy-to-use device that delivers expanded functionality and reliable results. Balance work, life and everything in between with the BlackBerry Curve 8900 smartphone.Move your mouse over the glowing hotspots to the left to discover the great features of the BlackBerry Curve 8900 smartphone.When you need help finding your way - or the nearest coffee shop-use the built-in GPS. Its designed to work with BlackBerry Maps and other location - based software, to help you figure out where you are and how to get to where you need to be. Use a Wi-Fi network to check email, shop online, stream videos and music or even make phone calls.6,7. Wireless home networks and public hotspots can give you access to all of your BlackBerry services.Setting up Wi-Fi networks on the BlackBerry Curve 8900 smartphone is easy and switching back and forth from your carrier service can be seamless. Updating the look of the Curve with a sleekly styled titanium finish, the BlackBerry Curve 8900 is the thinnest and lightest full-QWERTY BlackBerry smartphone yet. In addition to its stunning good looks--with titanium-colored finish accented by chrome highlights--the Curve 8900 is packed with communication and location features. The built-in Wi-Fi (802.11 b/g) supports both voice and data, while the built-in GPS supports location-based services including turn-by-turn navigation. And, of course, you'll enjoy all the communication and connectivity features you've come to expect from a Blackberry phone--including email served up by the BlackBerry Internet Service and a full menu of messaging options (SMS, MMS, and IM). The handset's advanced multimedia capabilities include a 3.2-megapixel camera with image stabilization, digital zoom, flash and the ability to record video and play video. Other features include a hot-swappable MicroSD/SDHC memory card slot (for cards up to 16 GB; 256 MB card included), Bluetooth for handsfree communication and stereo music streaming, multi-format digital audio player, unlimited any-network calling to any 5 people with a myFaves plan, and up to 5.5 hours of talk time. Unlocked Phone This unlocked cell phone can be used with a GSM network service provider and it provides quad-band connectivity (850/900/1800/1900 MHz) as well as EDGE data connectivity. It does not come with a SIM card, and it requires that you provide a SIM card for usage with your selected service provider. Staying Connected With BlackBerry's push email technology, your email will find you without having to initiate a connection. BlackBerry devices are designed to remain on and continuously connected to the wireless network, notifying you as new email arrives. In addition to the text, you can also receive and view attachments in a wide range of popular file formats, including Microsoft Office, Corel WordPerfect, and Adobe PDF. Browse the web with the integrated, full-featured browser, which quickly and efficiently displays HTML pages as well as enables you to set up RSS feeds to stay connected to up-to-the-minute news and blog posts. And keep up with your contacts using a variety of instant message (IM) networks, including the integrated Blackberry Messenger as well as downloadable clients for Google Talk, Yahoo! Messenger, and Lotus Sametime. For corporate users, the Curve delivers all the enterprise email and messaging capabilities you've come to expect. It's supported on BlackBerry Internet Service, giving you access to up to 10 work or personal email accounts (including most popular ISP email accounts), as well as BlackBerry Enterprise Server, enabling advanced security and IT administration within IBM Lotus Domino, Microsoft Exchange and Novell GroupWise environments. Phone Features With a refined design, the BlackBerry Curve 8900 smartphone supports both your professional and personal mobile communication needs to help you enjoy a more organized, balanced life. In addition to a sleek, stylish design, the powerful new smartphone includes a large, vivid display--the highest resolution available on a BlackBerry smartphone--as well as a 512 MHz next-generation processor for fast and responsive performance. The striking 2.4-inch, 480 x 360-pixel display (65K colors) serves up crisp images, text and maps so information is easier to read, even when you're on the go. It also includes a light-sensing feature that automatically adjusts backlighting for indoor, outdoor and dark environments. Like other Curve models, the Curve 8900 includes a trackball navigation system located on the top of the QWERTY keypad, and it features an integrated spell checker with a customizable dictionary to help maintain accuracy. You can snap vivid photos as well as video clips using the 3.2-megapixel camera on the back of the Curve, which also features a 2x digital zoom, auto focus, image stabilization, and a flash. Transfer pictures and videos between your smartphone and your desktop computer easily using the USB cable that comes with the smartphone, or via Bluetooth technology. You can also capture video clips on the go, with two resolution choices--480 x 352 pixels for saving to your PC and 176 x 144 pixels for sending via MMS messaging. In addition to recording videos, the Curve 8900 also supports mobile video streaming as well as videos saved from your PC. It's compatible with DivX, XviD (MPEG4 Advance Simple Profile), H.263, and WMV3 formats. Listen to your favorite music using an optional wireless headphone thanks to the Curve's support for the Bluetooth stereo audio profile (A2DP/AVRCP). The Curve is compatible with a wide variety of file formats (.3gp, WAV, MIDI, AMR-NB, G711u/A, GSM610, PCM, MP3, AAC/AAC+/eAAC+, WMA9/10 Standard/Pro) and dedicated volume controls are conveniently located on the side of the handset. Handsfree communication is easy thanks to the integrated speakerphone. This phone also provides Bluetooth wireless connectivity (version 2.0 + EDR), and includes profiles for communication headset, handsfree car kits, and file transfer. You can connect your laptop (either via Bluetooth or wired USB) and enjoy dial-up networking--surf the Internet, send email, and access files from a server. With the Voice-Activated Dialing (VAD) feature, you can initiate a call just by telling the Curve who to call from your contact list--either via the integrated speakerphone or using an optional Bluetooth wireless headset. Other advanced phone features include advanced sound technology that cancels out background noise and echo, dedicated volume and mute keys, and the ability to customize the Curve with polyphonic and MP3 ringtones. The BlackBerry Browser on the Curve 8900 is designed to make on-the-go Internet browsing fast and fun--you can even start a search right from the home page. Navigate sites and zoom in on content using a trackball-controlled pointer, set bookmarks and view your history. Plus, the BlackBerry Browser works with a host of other applications to make things like online purchasing and tracking information on your favorite pages easier. The easier a map is to read, the easier it is to follow. Together with BlackBerry Maps, the crisp, colorful screen of the Curve 8900 is designed to make it easier to find the location of businesses, restaurants, concert venues, parks and more by allowing you to check maps and get driving directions quickly and conveniently. When you're connected to the network, you can even launch maps from your address book. BlackBerry Maps is also designed to help make trips easier by providing route options like fastest or shortest and displaying directions visually along with text-based turn-by-turn instructions. Whether your instant messaging (IM) account is with Yahoo! Messenger, Google Talk, AOL Instant Messenger, ICQ or Windows Live Messenger, you can bring your IM community wherever life takes you. Like the desktop versions, these programs offer features like avatars and emoticons. And, because BlackBerry applications work together, you can also start an IM chat from your address book, call or email an IM contact while chatting or even check your calendar right from a chat. Other features include: Vital Statistics The Blackberry Curve 8900 weighs 3.9 ounces and measures 2.4 x 4.3 x 0.5 inches. Its 1400 mAh lithium-ion battery is rated at up to 5.5 hours of talk time, and up to 360 hours (15 days) of standby time. It runs on the 850/900/1800/1900 MHz GSM/GPRS/EDGE frequencies. What's in the Box Handset, battery, micro USB cable, travel charger, RIM documentation"
    ],
    "price": "$40.08",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31%2Bu3GQpW4L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51ptX2J51qL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41kL61GRxDL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41VFTWsnt1L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/412lvG2Bw5L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51Wm-3V9fhL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B00ASYZWNI",
    "title": "Sony Xperia E C1604 Dual-SIM Unlocked Android Phone--U.S. Warranty (Black)",
    "description": [
      "Sony Xperia E DUAL SIM (C1604) ; Black C1604, Xperia E DUAL SIM BLK, Unlocked GSM- DUAL SIM, Android OS, v4.0.4 (Ice Cream Sandwich), upgradable to v4.1.1 (Jelly Bean) 4 GB (2 GB user available), 512 MB RAM ; 3.5\" Multi touch display, 3.15 MP back camera, Internet and Wi-Fi capable."
    ],
    "price": "$77.12",
    "brand": "Sony",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51xHWyatsYL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31lB5aEtcPL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/419PnoIMeuL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/419PnoIMeuL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51Wm-3V9fhL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B001UBB9GM",
    "title": "Factory Unlocked AT&T Apple iPhone 3G 8GB Smartphone",
    "description": [
      "This update to the original iPhone adds 3G data, and has up to 8GB of internal memory. The 3G iPhone also has an updated OS supporting third-party software, corporate email, sync, and VPN features. Other key features include multi-touch display, WiFi, music player, full web browser and 2 megapixel camera. This is a quad-band GSM phone and is compatible with WCDMA frequencies for international roaming.This device may require a data plan for activation. Please, contact your phone carrier for details. A 3G SIM card is required to activate this phone (not included)."
    ],
    "price": "$64.95",
    "brand": "Apple",
    "imageURLHighRes": [],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B005HYU1YE",
    "title": "Blackberry Bold Touch 9930 CDMA GSM Unlocked Phone with Touch Screen, 5MP Camera and Blackberry OS 7 (Black)",
    "description": [
      "Create and connect like never before, swiping, pinching and zooming on the Liquid Graphics touch screen. Together with a 1.2 GHz processor, and a 24-bit high-res display, Liquid Graphics gives you fluid animations and instant response times. With an elegantly brushed stainless steel frame, sculpted surfaces and advanced composite backing, the BlackBerry Bold 9900/9930 smartphones are as lightweight and durable as they are feature-packed. Faster loading, faster scrolling, faster zooming. It's the fastest BlackBerry experience to date. The premium BlackBerry Bold 9900/9930 smartphones feature the most powerful engine ever in a BlackBerry smartphone. Move from home to the coffee shop to the airport and to the office without missing a beat while connecting to Wi-Fi hotspots wherever they're available. BlackBerry 7 is the next generation BlackBerry OS, packed with powerful new features and innovative apps. Augmented reality introduces exciting new ways to interact with the world around you, and with Near Field Communication1 (NFC) built-in, you can connect with other NFC-enabled devices and smart tags. Inspiring, special and funny moments happen on the fly. Capture it all with 720p HD video recording and an impressive 5 MP camera. Items that comes up with this cell phone includes handset, rechageable battery, charger, USB cable, Quick start guide."
    ],
    "price": "$79.31",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51NmQvsKbhL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41szTxR3XmL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41MRb4Vg3xL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41QSMeiVK9L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51V-Fu9TFFL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B003YHOXFY",
    "title": "BlackBerry Storm 2 9550 Unlocked Phone - No Warranty",
    "description": [
      "The sequel to RIM's first-ever touch screen Blackberry Smartphone, the unlocked Storm2. Not only does it include the business/multimedia features that made the first version popular amongst executives and entrepreneurs'. RIM further enhances the Smartphone with increased memory, the latest SurePress technology, and Bluetooth technology. This is Smartphone will definitely make you shine amongst others at the next board meeting. From organizational tools to social networking applications, this phone does it all with style and simplicity."
    ],
    "price": "$29.95",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41UnVDVFfjL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41nEcALFLTL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41VBxYcDowL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41kcpGBzkVL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51oOuebeICL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B005KMCLIW",
    "title": "Blackberry Torch 9810 Unlocked GSM Phone with OS 7.0, Touchscreen, Slider-QWERTY Keboard, Optical Trackpad, 5MP Camera, Video, GPS, Wi-Fi, Bluetooth and microSD Slot - Silver",
    "description": [
      "The BlackBerry Torch 9810 is an update to the original Torch 9800, and steps up to a higher resolution display, faster 1.2 GHz processor, HSPA 4G data, 8GB internal data, and HD video recording capability. The 9810 also sports BlackBerry 7 OS, a large 3.2 capacitive touch screen, physical QWERTY keyboard, 5-megapixel auto-focus camera, WiFi, full web browser, microSD memory card slot, and 3.5mm audio jack. This smartphone is equipped with quad-band GSM and WCDMA modes for international use."
    ],
    "price": "$26.42",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31mNVytxraL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/415uTECYEcL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/21aLvp0nJGL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41O6Fpegd3L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51UfKiKLI1L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41c7wxSaoGL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B0078ZZ6RM",
    "title": "Blackberry Curve 9360 Unlocked Quad-Band 3G GSM Phone with 5MP Camera, QWERTY Keyboard, GPS and Wi-Fi - No Warranty - Black",
    "description": [
      "No matter what you're into, BlackBerry Curve 9360 smartphone have what you need to keep up, including a powerful processor and super fast browser. And with a 5 MP camera with flash, you'll be ready to capture all those fun and memorable moments. The easy-to-use next generation BlackBerry OS delivers the smoothest and fastest BlackBerry experience to date. It also comes with new, pre-installed apps and services like Social Feeds, Music Storefront and BlackBerry Protect1. Enjoy responsiveness, smoother rendering, fluid animations and a stunning graphical display. Thanks to the graphics processing and fast CPU and JavaScript performance. Experience the fastest BlackBerry Browser ever with seamless panning and zooming, better web-based video and gaming, and HTML5 video support. With Near Field Communication (NFC)2 built right in, you simply tap to connect. You can link up with other NFC-enabled devices and read smart tags to exchange data or launch an app. Be part of your social network with the new BlackBerry Messenger. BlackBerry Curve 9360 smartphone are super easy to slide in your pocket and feel \"just right\" in your hand. Plus, with an array of color options and a ton of accessories, you can really make them your own. Need to set up your email? Want to change your Internet options? Get up and running in no time. Whether you're at home, at work or on the go, it's easy to keep tabs on what's happening by connecting to an available Wi-Fi network. Surf your favorite blogs and websites, text and IM-all at the same time."
    ],
    "price": "$22.90",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41nsLt15%2BVL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/313-Qj5fYYL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41DHdU-4B6L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51JIyfrgYvL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51Wm-3V9fhL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B0062ICRGE",
    "title": "Apple iPhone 4S Unlocked Cellphone, 16GB, White",
    "description": [
      "The iPhone 4S is the follow-up to the very popular iPhone 4 and features a faster Apple A5 dual-core processor and improved 8 megapixel camera. The iPhone 4S also features Siri - a voice assistant heeding natural-language questions and commands, and taking dictation. Other features of this smartphone include a gorgeous 3.5-inch high-resolution display, full web browser, Bluetooth compatibility, music player, WiFi, and 16 GB of internal memory. The dual core A5 chip delivers even more power. The 8MP camera with all new optics also shoots 1080p HD video. And if there s anything else you need, just ask Siri"
    ],
    "price": "$90.01",
    "brand": "Apple",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/414%2Bi6cP1aL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/414%2Bi6cP1aL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B0016JDBYG",
    "title": "Motorola RAZR V3 2G Unlocked Phone with Camera, and Video Player -This phone will not work for AT&T or Any AT&T sub-carriers.",
    "description": [
      "The Moto Razr V3 is expertly crafted to deliver exceptional performance. Inside the ultra-thin design are advanced features like MPEG4 video playback, Bluetooth wireless technology, a digital camera and more. And with the precision-cut keypad, minimalist styling and metal finish, the V3 looks just as beautiful as it performs. The real difference is in the details. See who's calling, in color without opening your phone, the large internal display is complemented by an impressive external display. The precision-cut metal keypad reacts to the lightest of touches. And the features you can't always see are equally impressive, like quad-band GSM for global calls where GSM network coverage and roaming agreements are present. At just over a half-inch thick, the Motorola RAZR V3 is the perfect combination of sleek design and powerful features. An impressive quad-band GSM phone (great for global travelers), the RAZR V3 includes a VGA (640 x 480) camera, Bluetooth connectivity for communication headsets, dual LCD screens, video clip playback, and up to 7 hours of talk time. This unlocked cell phone can be used with a GSM network service provider and it provides quad-band connectivity (850 MHz, 900 MHz, 1800 MHz, 1900 MHz). It does not come with a SIM card, and it requires that you provide a SIM card for usage with your selected service provider. This phone comes with a one-year warranty from a third party provider. Phone Features The RAZR V3 has a large 176 x 220 color display with 262,000 colors dominates the inside of the top cover, and a supplementary 96 x 80 full-color display on the outside that can display pictures, time, call information, battery and signal strength, and more. Most of the phone's features and on-screen menus are controlled by a five-way center button on the handset's backlit control pad, which is precision cut from a single sheet of nickel-plated copper alloy. A charging port and USB data cable port is placed on the bottom of the phone. Bluetooth Wireless TechnologyStay connected without wires. Choose from a range of optional Bluetooth accessories. MPEG4 Video PlaybackDownload and watch sports action and music clips. They're all beautifully displayed on the large 2.2 color display. Built-in SpeakerphoneKeep the conversation flowing when you're busy by going hands-free. Or exchange ideas in a conference call. Anodized Aluminum CaseThe ultra-thin Moto Razr V3 has the distinctive metallic luster of anodized aluminum. Digital CameraCapture your world in style. Create memorable images with the effective 4 x digital zoom and quick exposure controls. The RAZR V3's internal phone book can hold up to 1000 contacts, while the phone's picture ID system allows you to assign pictures to your most common callers. It also supports polyphonic ringtones as well as MP3 ringers, allowing you to use portions of your favorite songs to alert you to incoming calls. There's even an included application, MotoMixer, that lets you mix your own ringtones. For times when you want to be discreet, there's a vibrating alert. A built-in speakerphone makes it easy to talk without having the phone to your ear while voice activated dialing makes calling your friends, family and associates as easy as saying their names. The RAZR V3 is a messaging and wireless Internet powerhouse. Support is built in for sending and receiving pictures, text, graphics, sound and video via messages. When used in combination with the phone's built-in still and video camera, MMS opens up a whole new world of messaging fun. Instant messaging is also included (with support for AOL, Yahoo!, MSN, and ICQ), and the phone ships with a built-in email client with support for POP3, IMAP4 and SMTP protocols. iTap text entry, which is a technology that makes it easier for people to enter words and text on handsets, is built into the unit-- a plus for mobile email and text messaging users. A number of handy software tools are bundled with the RAZR V3 including a voice memo recorder, a calculator with currency converter, a calendar and an alarm clock. Use the phone's Bluetooth capability to set up a wireless link with a Bluetooth accessory or connect to a computer or hand-held device to exchange and synchronize data. The phone also supports the SyncML PC synchronization standard, can be used with Motorola's Mobile Phone Tools PC application to manage and synchronize contacts, calendar and other data with your PC. The phone's VGA camera features a 4x zoom, image quality options, and an auto-timer so you can be in your pictures, too. Capture stills and then send them to your friends via MMS messaging or email, or to your PC via USB or Bluetooth. The phone is capable of MPEG4 video playback when you receive a video message, or if you upload video to the phone via USB or Bluetooth. The RAZR V3 also supports custom graphics for wallpapers so you can dress up the phone to suit your fancy. Operating the RAZR Battery Door The RAZR V3's battery cover is designed to have a very tight fit with the phone case. You may need to use your fingernail or a very thin instrument to depress the small battery cover release button. When replacing the cover, make sure the cover securely snaps into place before operating the phone. Vital Statistics The Motorola RAZR V3 weighs 3.42 ounces and measures 3.86 x 2.09 x 0.54 inches. Its 680 mAh lithium-ion battery is rated at up to 6.7 hours of talk time, and up to 250 hours of digital standby time. It runs on the 850/900/1800/1900 GSM/GPRS/EDGE frequencies. This phone comes with a one-year warranty from a third party provider."
    ],
    "price": "$99.00",
    "brand": "Motorola",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41N04R0WWJL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/316FNCY0YEL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/21Y5Q4XF2QL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/317ZD557Y9L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/21XMZHNP3NL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/21V7Q9S5MXL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B0034TZONM",
    "title": "Blackberry 9700 Bold Unlocked Quad-Band 3G Smartphone with 3.2 MP Camera, GPS, Wi-Fi and Bluetooth (Black)",
    "description": [
      "The BlackBerry Bold 9700 smartphone has a large, hi-resolution screen that displays over 65,000 colors creating a vivid viewing experience for all your photos, videos, files, and websites. Access what's important with trackpad navigation based on how laptops are designed. Glide your finger over the trackpad to scroll through menus and icons. A slight press and click lets you select an item to navigate where you want to go. Enjoy music, videos, photos, and documents in great color and sound. Easily sync data and audio files from your desktop to the BlackBerry Bold 9700, and get up to 35 hours of music playback time. Enhance the 256 MB of on-board flash memory by easily inserting a microSD card. Create extra room for emails, messages, apps, multimedia files, documents, and all the other important things that you want to take with you. Along with a 3.2 MP camera, the BlackBerry Bold 9700 smartphone features video camera functionality. Record and view videos on the hi-res screen, and share them through email, text messages, or social networking sites. High-speed 3G network connectivity lets you browse the web or view email attachments faster, while Wi-Fi support enables your BlackBerry Bold 9700 smartphone to access available hotspots."
    ],
    "price": "$40.08",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51DXleVOlTL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/416STSWxhQL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41JsE8EHMYL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51Wm-3V9fhL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B0036DDT74",
    "title": "Nokia X6 Unlocked GSM Phone, 16GB, Black",
    "description": [
      "Nokia X6 Unlocked GSM Phone, 16GB, Black",
      "A powerful entertainment and on-the-go social networking device, the Nokia X6 mobile phone features a lush 3.2-inch widescreen capacitive touch display, 5-megapixel camera with Carl Zeiss optics and dual LED flash, integrated GPS with free Ovi Maps Navigation, and 16 GB of internal memory. You'll have tons of space to save your pictures, music, video clips, and data, and you can always grab more games and applications downloaded from the Ovi Store."
    ],
    "price": "$81.47",
    "brand": "Nokia",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41sH7CghJ8L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41nbcS68ShL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51Wm-3V9fhL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B00B90KCNU",
    "title": "BlackBerry Z10 16Gb White WiFi Touchscreen Unlocked GSM QuadBand Cell Phone",
    "description": [
      "Introducing a completely new way to use your smartphone. A new experience where features and apps work together seamlessly and share your train of thought to help you complete tasks faster and with ease. Discover BlackBerry Z10, designed to keep you moving."
    ],
    "price": "$27.57",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51uuf6eUJYL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B007INF67O",
    "title": "Pantech Pocket P9060 Unlocked GSM Phone with Android 2.3 OS, Touchscreen, 5MP Camera, Video, GPS, Wi-Fi, SNS integration, MP3/MP4 Player and microSD Slot - Gray",
    "description": [
      "Have high-end entertainment at your fingertips with the Pantech Pocket P9060 Smartphone. Featuring a resolution of 800x600 pixels, the wide 4.3-inch screen not only displays clear content but also lets you navigate through its menu with ease. With the 5 MP camera, you can easily capture crisp and clear images. Running on the Android 2.3 Gingerbread OS Platform, the Pantech Pocket also enables you to access various interesting Google applications. Whats more, the powerful 1650 mAh Li-ion battery ensures a talktime of up to 180 minutes and a standby time of up to 250 hours."
    ],
    "price": "$64.27",
    "brand": "Pantech",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51lOh3pfuXL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/515rQLTCzML.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/517uOyFXS4L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/512818I5yDL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B007I4GHFI",
    "title": "Samsung Galaxy Y Duos S6102b Android Dual SIM Quadband Factory Unlocked Phone - Strong Black",
    "description": [
      "The Galaxy Y DUOS runs on the Android 2.3 OS, which features Dual-Sim allowing to separate your personal and professional life. It comes with a bigger 3.14\" display, 3MP camera and the usual set of options for Android phones - Wi-Fi, GPS, microSD card slot, FM Radio.  FEATURES:  3.14 inched QVGA Capacitive touch screen with 256k colors support, Gingerbread 2.3, 109.8 x 60 x 12mm, 109 gms, Powered with Samsungs Touch Wiz, Supports 32GB micro SD Card, , 512MB ROM, 384MB RAM, Supports Wi-Fi 802.11 b/ g / n support, Wi Fi Hotspot, Bluetooth 3.0 with A2DP Support, 3.15 MP camera with 2048 x 1536 pixels, HSDPA 7.2MBPS, No Secondary Camera, Supports Stereo FM Radio, Google Apps, Adobe Flash is Supported, Micro USB 2.0, Supports A-GPS, Dual Sim, 1300 Mah Battery"
    ],
    "price": "$50.05",
    "brand": "Samsung",
    "imageURLHighRes": [],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B004748YPS",
    "title": "Blackberry 9100 Pearl 3G Unlocked Phone with 3 MP Camera, Wi-Fi, Bluetooth, Optical Trackpad and GPS No Warranty Black",
    "description": [
      "The smallest BlackBerry smartphone yet, the BlackBerry Pearl 3G 9100 smartphone is as powerful as it is compact. This stylish world phone offers global 3G connectivity, a brilliant high-resolution screen, and an innovative keyboard with Sure Type technology that supports the advanced messaging features. It's ideal for those who prefer a compact device, but still want a smartphone that delivers a full BlackBerry experience. The Sure Type keyboard anticipates your words for easy texting and e-mail. This unique predictive text technology, known as Sure Type, makes the Pearl 3G's diminutive size possible. Sure Type also learns the words you use most often, further enhancing your typing speed. Enabled for use lightning quick HSPDA 3G network, you'll be able to easily access the Internet as well as quickly download video, music and more. You'll enjoy all the communication and connectivity features you've come to expect from a BlackBerry phone including e-mail served up by the BlackBerry Internet Service and a full menu of messaging options (SMS, MMS, and IM). And with its Wireless-N Wi-Fi capabilities (802.11b/g/n), the Pearl 3G will receive Wi-Fi access at U.S. hotspots. You'll be able to access BlackBerry App World to download applications from a broad and growing catalog of third-party mobile applications developed specifically for BlackBerry smartphone, including games, entertainment, social networking and sharing, news and weather, productivity and more. The Pearl 3G runs the BlackBerry OS 5, but it's ready for upgrading to BlackBerry OS 6. A hot-swappable microSD/SDHC memory card slot provides additional storage for multimedia files and archiving applications. Other features include a 3.2-megapixel camera/camcorder, Bluetooth 2.1 connectivity for hands-free devices and stereo music streaming, visual voicemail for easier access and response to voicemails, and up to 5.5 hours of talk time."
    ],
    "price": "$40.08",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41sHQW8u6PL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31blL3zQXXL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41DImCqfe7L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41rqgIz9MVL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B008DYS016",
    "title": "LG Optimus L7 P705 Factory Unlocked International Version No Warranty Gsm Android Phone, White",
    "description": [
      "Bring Style to your life  Find satisfaction in a design of LG Optimus L7 that has both an exquisite style and a comfortable grip. Discover the perfect coexistence of cool metallic accents and soft casing with the human touch that completes your style. LG's exclusive Floating Mass Technology creates the illusion that LG Optimus L7 is even slimmer than its 8.7mm body. The sleek and slim design easily slips into bags or pockets for maximum portability. Marvel its neat and flawless key arrangement that helps maintain the minimal sophistication.  Bring Pleasure to your eyes  The largest-in-class 4.3 wide display allows you to see text in full-size for readability that's always comfortable and efficient. Enrich your viewing experience as images and videos come across with more vibrant colors and precise details to provide you with the utmost viewing quality whether your indoors or outdoors. Optimally surf the web and update your favorite SNS sites with the perfect screen size for comfort, readability and usability."
    ],
    "price": "$16.00",
    "brand": "LG",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31fkduqKm-L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41ObOcvOcZL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31cocmWZYGL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41BV9fVvcTL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B0092GJNII",
    "title": "Samsung Galaxy Note I717 16GB 4G LTE GSM Android Phone - Carbon Blue (AT&T version)",
    "description": [
      "",
      "The Samsung Galaxy Note SGH-I717 is a unique device bridging the gap between phones and tablets with its extra-large 5.3-inch Super AMOLED HD display. The Galaxy Note offers a unique feature that includes a stylus pen and handwriting recognition, with multiple exclusive apps for taking notes, sketching, and more. This device is also equipped with 4G LTE data, 8-megapixel camera with a 2-megapixel front camera, 1.5 GHz dual-core processor, Wi-Fi, DLNA WiFi streaming, and quadband GSM along with WCDMA modes for international use. You can also use this device to access thousands of apps, games, movies, books, and music on Google's Play Store."
    ],
    "price": "$74.98",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31Pl90x9mWL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31Kwx-tuftL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41wCp%2BTTs3L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41-aGOHOzQL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31BKxaDIm4L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51s5YzWzDaL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B00A29WCA0",
    "title": "Samsung Galaxy S3 Mini GT-i8190 GSM Unlocked International Version White - NO WARRANTY",
    "description": [
      "The GALAXY S3 mini runs Android 4.1 (Jelly Bean)with a 4.0 display while maintaining the familiar Galaxy S3 design. The Galaxy S3 Mini is powered by NovaThor U8420 Dual-core 1 GHz CPU with 1GB of RAM and a 5MP camera that does 720p HD videos. The Galaxy S3 Mini is full of graphical capabilities, fast screen transitions, and an upgraded Google Now service featuring contextual search. Over at the front, there's a VGA camera for conference calls. The 4.0 display is of Super AMOLED variety and pushes 800&#xD7;480 resolution."
    ],
    "price": "$189.00",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31HCu8dWHyL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41CsHoptcEL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31jj0Iunp1L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/216pmXYOQ3L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/21cCXNox7dL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31zCS1CAbrL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B0061YRDX6",
    "title": "Samsung Galaxy Note N7000 16GB Unlocked Android Smartphone - Dark Blue",
    "description": [
      "Galaxy Note is A new type of smartphone, borne of insight and innovation. It is the ultimate on-the-go device which consolidates core benefits of diverse mobile devices while maintaining smartphone portability. It empowers you with everything you can ever desire so that you can simply, feel free. It is truly smart. \n\nConsumer research indicates that people always want to do more tasks much better, even on the go, whether it is web browsing, email, games, or viewing photos and videos. To do all this, consumers carry multiple devices, because each device has unique benefits that work best in a particular situation. Therefore, consumers constantly switch devices to use the right device at the right time. \n\nEven for consumers with multiple smart devices, they still carry around a notepad for writing down ideas. There is an emerging desire for a primary device for on-the-go use that could consolidate the core tasks of multiple devices as well as recreate the ease and simplicity of using a pen and paper. \n\nThe GALAXY Note was created to reflect your desires. The Galaxy Note is a primary device that will minimize the need to switch to other devices while on the go and open up the potential of your mobile experience."
    ],
    "price": "$199.00",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31s-u00f2LL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41J0rA-CHJL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B001V7RK8G",
    "title": "BlackBerry Pearl 8100 Unlocked Phone with Quad-Band GSM,GPRS, EDGE, 1 MP Camera, Camcorder and bluetooth v2.0 compatible - International Version with No Warranty (Black with Silver)",
    "description": [
      "Find more life. Enjoy fun and functionality in a small, stylish device. BlackBerry Pearl 8100 series smartphones offer everything you're looking for from a mobile phone, without sacrificing the full BlackBerry smartphone experience.",
      "Access your multimedia files and e-mails with the touch of a button. Take the BlackBerry Pearl 8100 Smartphone with you on the road. Considered one of the world&rsquo;s smallest smartphones, it comes complete with digital camera, media capabilities and expandable memory. Jot down important dates on the Calendar, talk to friends via Instant Messaging, or keep track of your to-do lists with Tasks. Measuring only 4.2&rdquo; x 1.97&rdquo; x.57&rdquo;, the Blackberry is also Bluetooth enabled. The Bluetooth feature allows you to talk hands-free, so you can focus on the road while you&rsquo;re driving. Additionally, take advantage of Blackberry maps to help find your way across town. Equipped with 64MB of memory, the Blackberry Pearl provides Quad-Band network support on 850/900/1800/1900 MHz GSM/GPRS and EDGE* networks to allow for international roaming between North America, Europe and Asia Pacific. It&rsquo;s the ultimate combination of brains and beauty. Small. Smart and Stylish. So you can live large."
    ],
    "price": "$96.58",
    "brand": "Motorola",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/51PofV57K1L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41qW5oVPjzL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51Wm-3V9fhL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B001F7VN6M",
    "title": " BlackBerry Bold 9000 Unlocked Phone with 2 MP Camera, 3G, Wi-Fi, GPS Navigation, and MicroSD Slot--International Version with No Warranty (Black)",
    "description": [
      "The fastest, most powerful BlackBerry ever has arrived. It's a global phone equipped with 3G simultaneous voice and data capability. Crafted from premium materials, inside and out, this smartphone is designed to give business professionals and power users unprecedented functionality and performance in an intuitive design. It's fully loaded with integrated GPS with WiFi for access at thousands hotspot locations nationwide, including. The color LCD screen is fused to the undersurface of the lens, making images leap out with stunning definition and clarity. Pictures are vibrant and sharp, while videos play smoothly and Web pages, documents, presentations, and messages snap with exceptional quality and contrast."
    ],
    "price": "$27.57",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41fuyNVc5uL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41ROCXld5VL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41JNXfYWZ7L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51Wm-3V9fhL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B003ZX7RNC",
    "title": "Nokia N8 Unlocked GSM Touchscreen Phone Featuring GPS with Voice Navigation and 12 MP Camera (Silver/White)",
    "description": [
      "Make the most of every moment, then play it all back in HD with the Nokia N8. This high-tech device offers video recording in HD, plus instant video editing, a 12 megapixel camera and the ability to upload video to share with your friends and family. The Nokia N8 also packs a 3.5&#8221; touchscreen, free* voice-guided navigation from Ovi Maps, apps from Ovi Store and an impressive design, making this the phone that has it all. Live in high definition. The Nokia N8 lets you shoot HD video in 720p resolution right on your phone, while preloaded editing software makes it easy to instantly edit your video. Built-in HDMI output allows you to use an HDMI cable (not included) to connect the device to your compatible TV or computer and play back your videos and other HD content on your device in breathtaking HD. Or upload your videos to your PC to share with friends and family. The Nokia N8 also features a best-in-class, 12 megapixel camera with Carl Zeiss optics to capture high-quality images. Get what you want and get where you want to go. Ovi Store offers thousands of available apps, games, videos and more. Stay in touch with apps like Snaptu; experience the best in photo and video apps with Qik, Photo Twister and Snapfish; and get ready for other great apps coming soon, including Open Table, SalesForce, Pocket Movie and Accuweather. Plus, find the route to anywhere with preloaded Ovi Maps, complete with free* voice-guided navigation to get anywhere you need to go, 3D landmarks and a share location feature to let Facebook friends know where you are. Discover a new standard in mobile entertainment with a vibrant 3.5&#8221; OLED capacitive touchscreen display. Connect your device to your home theater system to take the HD experience even further with Multichannel 5.1 Dolby Surround Sound. With an eye-catching exterior to match the on-screen experience, the Nokia N8 always looks good. Connect in HD today with the Nokia N8."
    ],
    "price": "$68.19",
    "brand": "Nokia",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41M8JTg9T7L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/517g2oUzJTL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31l5aFDUQwL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/21PVN31fWiL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/211dtiYJDLL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41orhALXGML.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51tV6EaGsXL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41RKwYT8TKL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51l46qQB50L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41GcQutURPL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B0058GWR8O",
    "title": "BlackBerry Bold 9900 GSM Factory Unlocked Phone - No Warranty (Black)",
    "description": [
      "Technical Details : 2.8\" capacitive touch display Full, wide QWERTY keyboard BlackBerry 7 OS 1.2 GHz Processor 5.0MP camera with flash 720p HD video recording capability 1230 mAH battery 768 MB RAM 8GB on-board memory Micro SD slot supports up to 32GB Dual-band Wi-Fi GPS Tri-band HSPA+, Quad-band GSM/EDGE NFC technology New Augmented Reality enabled with digital compass and accelerometer BlackBerry QWERTY keyboard 24-bit high-resolution touch screen 10.5mm thin design New powerful 1.2GHz processor 8GB onboard memory expandable up to 40GB through uSD card Dual-band (2.4GHz & 5GHz) Wi Enabled for new NFC and Augmented Reality New digital compass Next generation BlackBerry 7 OS Featuring Liquid Graphics Fastest BlackBerry Voice activated universal search Full HD video recording Most pre-Installed apps Iconic BlackBerry QWERTY keyboard 24-bit high-resolution touch screen 10.5mm thin design Fully loaded with the latest technologies New powerful 1.2GHz processor 8GB onboard memory expandable up to 40GB through uSD card Dual-band (2.4GHz & 5GHz) Wi Enabled for new NFC and Augmented Reality New digital compass Next generation BlackBerry 7 OS Featuring Liquid Graphics Fastest BlackBerry Voice activated universal search Full HD video recording Most pre-Installed apps New high resolution touch screen High-res full touch screen - all in the thinnest BlackBerry Bold 6% larger than the BlackBerry Bold 9000 16 million colors Premium materials and finishes Wi-Fi Fastest Browser ever Voice activated on a BlackBerry smartphone ever New BBM New BlackBerry App World Docs to Go BlackBerry Balance BlackBerry Protect Social Feeds BlackBerry Music Storefront BlackBerry PlayBook ready"
    ],
    "price": "$27.57",
    "brand": "BlackBerry",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/31xBmPWzHlL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31hUy20zbNL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31FN2L5nNdL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41cS9ZD7jrL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41CoYLX8z3L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41pYzJEcb2L.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B00607JBNO",
    "title": "Samsung Galaxy Exhibit 4G (T-Mobile), t679",
    "description": [
      "Samsung Dart Prepaid Android Phone (T-Mobile) with 1 year parts and labor warranty. Budget-friendly and feature-rich, the Android-powered Samsung Exhibit II 4G keeps you connected to everything you love--fast. And with prepaid and postpaid calling plans from T-Mobile's No Annual Contract, you'll be able to pay the way you want without being tied down to a monthly contract. Combining a 1 GHz processor and T-Mobile's blazing fast 4G network, the Exhibit II provides seamless viewing of live and on-demand channels from preloaded T-Mobile TV--including free programming from select stations like ABC News Now, FOX Sports, PBS Kids and Azteca America. This phone is specifically designed for T-Mobile's 4G HSPA+ mobile broadband network, which currently covers over 200 million people across the U.S. The Exhibit II 4G also offers Wireless-N Wi-Fi networking as well as the ability to share its 3G/4G Internet connection with other laptops and other Wi-Fi enabled devices. Capture on-the-go photos and videos with the 3-megapixel camera (with DVD-quality video capture). Additionally, the Exhibit II is outfitted with a front-facing VGA camera for composing self portraits for social networks as well as video chats over 4G or Wi-Fi. Other features include a 3.7-inch multi-touch display, Bluetooth 3.0 connectivity for hands-free devices and stereo music streaming, microSD memory expansion to 32 GB, access to personal/corporate e-mail, music player, full HTML web browser with support for Flash, and up to 5.5 hours of talk time. Samsung's Media Hub enables you to rent or purchase movies and TV shows within seconds watch from the convenience of anywhere. With Media Hub's progressive downloading feature, you can start watching your content almost immediately as the rest of the file downloads to the Exhibit II. Plus, all Media Hub content can be shared among five Media Hub-enabled devices on the same account. The pre-loaded T-Mobile TV app offers access to live and on-demand mobile HDTV on T-Mobile's 4G network, including free programming from select stations like ABC News NOW, FOX Sports, PBS Kids, and Azteca America. You can upgrade T-Mobile TV to a variety of premium packages, including Prime (with ESPN Mobile TV, Disney Channel, CNBC, and more), En Espa&ntilde;ol, Life & Style, and Crackle Movies. The Samsung Exhibit II 4G weighs 4.1 ounces and measures 4.54 x 2.35 x 0.45 inches. Its 1500 mAh lithium-ion battery is rated at up to 5.5 hours of talk time, and up to 360 hours (15 days) of standby time. It runs on the 850/900/1800/1900 MHz GSM/GPRS/EDGE frequencies, as well as T-Mobile's 3G/4G network (1700/2100 MHz; UMTS/HSDPA/HSPA+). Samsung Exhibit II 4G handset, rechargeable battery, charger, USB cable, quick start guide. T-Mobile prepaid plans give you wireless access with less commitment, so you can pay--and talk--as you go. With no annual contract, no credit check, and no monthly bill, prepaid plans are a simple, direct way to go mobile. There are many ways to conveniently refill your T-Mobile Prepaid Plan so that you can stay continually connected with the people who matter most, including using web2go directly from your phone, via the T-Mobile Web site, or using refill cards available at over 90,000 locations nationwide. With Pay As You Go, you get wireless service exactly how you like it--there's no long-term contract, no credit checks, and no surprises. Add $100 in refills with Pay As You Go and you'll become a Gold Rewards customer, which gets you 15 percent more minutes on all refills and your minutes won't expire for a year after the time you refill. As of October, 2011, T-Mobile's 4G (HSPA+ 21) network is available in over 190 major metropolitan areas across the U.S.--covering 200 million people across the country. Network upgrades will continue rolling out through 2012. With typical download speeds that are on par with or faster than competing 4G technologies, T-Mobile's HSPA+ network provides fast data speeds, while allowing simultaneous voice and data capabilities for the ultimate wireless voice and data experience. You'll enjoy faster Web browsing, uninterrupted video streaming, and quicker app downloads. T-Mobile's 4G mobile broadband network (powered by HSPA+) provides a theoretical capability of up to 21 Mbps peak download speeds, with average download speeds typically in the 5 to 8 Mbps range. Effortlessly transition between Wi-Fi calling and T-Mobile's wireless network while you talk with T-Mobile's innovative Wi-Fi Calling technology. Wi-Fi Calling is a free feature for this phone, and minutes used while connected to the Wi-Fi network count against available rate plan minutes. Powered by Kineto's Smart Wi-Fi Application, T-Mobile's Wi-Fi Calling for Android smartphones is ready to use out-of-the-box, providing the ability to make voice calls and send SMS from accessible Wi-Fi (802.11 b/g/n) access points across the globe in addition to the connectivity available through T-Mobile's mobile network. The application also includes a tutorial for first-time users. The Samsung Exhibit II runs the Android 2.3 operating system (dubbed Gingerbread)--the fastest version of Android available for smartphones yet. It features a cleaner, more refined interface with new icons, improved top notification bar, and more intuitive navigation. Multitasking in Gingerbread allows you the ability to run more than one app at a time. If you're playing a game, you can easily switch to an incoming e-mail and then switch back to the game without losing your place. And like the previous version of Android (\"Froyo\"), Gingerbread provides support for Adobe Flash Player 10.1 for access to the full Web. The onscreen keyboard makes it easier to type thanks to additional spacing between the keys and larger font sizes. And the more you use the keyboard, the easier typing will be as the enhanced suggest feature records previous input history to make better suggestions. The Exhibit II also brings one-touch access to the popular Google mobile services you use every day. It also provides easy access to both personal and corporate e-mail, calendars, and contacts supported by Exchange Server and Gmail. And through Android Market, you'll get access to thousands of useful applications, widgets, and fun games to download and install on your phone, with many more apps being added every day."
    ],
    "price": "$44.50",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41k9x0Q2GIL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41tXmC6k0vL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41ZK5jyBwjL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/21Z3LuJIIjL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/214ZM8n9IiL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B00915VL58",
    "title": "Samsung Galaxy S3 I747 16GB Unlocked GSM LTE Android Smartphone - Red",
    "description": [
      "Designed for humans and inspired by nature, the 4G LTE AT&T version of the Galaxy S3 sees, listens, and responds to your requirements"
    ],
    "price": "$72.25",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/4156Ntkdn9L.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51OPRhcldSL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/41VBgp8HgFL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/21iiYSTeOgL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/21J1wS5%2BppL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/514wmv3eNyL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/51gklfZEPIL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B004B9QNJS",
    "title": "Samsung i897 Captivate Android Smartphone Galaxy S GSM Unlocked - Black",
    "description": [
      "The Captivate is part of Samsung's Galaxy S series, it is a high-end Android smartphone sporting a beautiful 4 inch super AMOLED display, fast 1GHz processor, and 5 megapixel camera with advanced options and video capture. Other key features include 16GB of internal memory plus a microSD slot for additional storage, Bluetooth 3.0 compatibility, Wi-Fi with DLNA streaming, 3.5mm audio jack, and a multi-touch touchscreen. This Android phone supports multiple languages and comes equipped with quad-band GSM and WCDMA modes for international use. Use this smartphone to access thousands of apps, games, books, movies, and music on Google Play Store."
    ],
    "price": "$59.63",
    "brand": "Samsung",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41KV3GzfdNL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/216ijvIEFVL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  },
  {
    "asin": "B006FMDVDK",
    "title": "Apple iPhone 4S Unlocked Cellphone, 16GB, Black",
    "description": [
      "The iPhone 4S is the follow-up to the very popular iPhone 4 and features a faster Apple A5 dual-core processor and improved 8 megapixel camera. The iPhone 4S also features Siri - a voice assistant heeding natural-language questions and commands, and taking dictation. Other features of this smartphone include a gorgeous 3.5-inch high-resolution display, full web browser, Bluetooth compatibility, music player, WiFi, and 16 GB of internal memory. The iPhone 4S also comes equipped with quadband GSM, CDMA, and WCDMA modes for international use."
    ],
    "price": "$93.41",
    "brand": "Apple",
    "imageURLHighRes": [
      "https://images-na.ssl-images-amazon.com/images/I/41-yv3wZhAL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31bwx2IORTL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31WJI4vTtfL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/311BCwEfXVL.jpg",
      "https://images-na.ssl-images-amazon.com/images/I/31bVhjGeWsL.jpg"
    ],
    "categories": [
      ["Cell Phones & Accessories", "Cell Phones", "Unlocked Cell Phones"]
    ]
  }
]
